Repository: fspv/simpletest
Catalog: translations/*.po
Languages: ru

source: Displays all created tests
ru: Показывает все созданные тесты

source: Change SimpleTest settings
ru: Изменить настройки SimpleTest

source: Tests
ru: Тесты

source: Manage SimpleTest tests (add/remove/edit)
ru: Управление тестами (добавление/удаление/редактирование)

source: SimpleTest edit test
ru: Редактирование теста SimpleTest

source: SimpleTest add test
ru: Добавить тест SimpleTest

source: SimpleTest add new test
ru: Добавить новый тест SimpleTest

source: SimpleTest test summary
ru: Сводка о тесте SimpleTest

source: Do you really want to remove the test?
ru: Вы действительно хотите удалить тест?

source: SimpleTest remove test
ru: Удалить тест SimpleTest

source: Edit question
ru: Редактировать вопрос

source: Simpletest edit question
ru: Редактировать вопрос SimpleTest

source: Add new question
ru: Добавить новый вопрос

source: Results for the test
ru: Результаты теста

source: SimpleTest results for the test
ru: Результаты теста SimpleTest

source: Result for the test for group
ru: Результаты теста для группы

source: SimpleTest result for the test for group
ru: Результаты теста Simpletest для группы

source: Result for the test for user
ru: Результаты теста для пользователя

source: SimpleTest result for the test for user
ru: Результаты теста SimpleTest для пользователя

source: First name
ru: Имя

source: Last name
ru: Фамилия

source: Group
ru: Группа

source: Login
ru: Имя пользователя

source: Value must not be empty
ru: Значение не должно быть пустым

source: Only numeric values are allowed
ru: Допустимы только числовые значения

source: You are the bot. I'm sorry :(
ru: Извините, но Вы - бот :(

source: There is more than one user with this parameters. Contact the administrator
ru: Уже существует пользователь с такими данными. Сообщите администратору сайта

source: You finished this test!
ru: Вы закончили тест!

source: Skip
ru: Пропустить

source: Answer
ru: Ответить

source: You must select the answer
ru: Вы должны выбрать ответ

source: Test name
ru: Название теста

source: Discipline
ru: Предмет

source: Academic year
ru: Год обучения

source: Edit
ru: Редактировать

source: Remove
ru: Удалить

source: Results
ru: Результаты

source: <a href="!base_path/admin/settings/simpletest/tests/edit/!tid">Edit</a>
ru: <a href="!base_path/admin/settings/simpletest/tests/edit/!tid">Редактировать</a>

source: <a href="!base_path/admin/settings/simpletest/tests/remove/!tid">Remove</a>
ru: <a href="!base_path/admin/settings/simpletest/tests/remove/!tid">Удалить</a>

source: <a href="!base_path/simpletest/results/!tid">Results</a>
ru: <a href="!base_path/simpletest/results/!tid">Результаты</a>

source: <a href="!base_path/admin/settings/simpletest/tests/add/">Add test</a>
ru: <a href="!base_path/admin/settings/simpletest/tests/add/">Добавить тест</a>

source: The name of the test cannot be empty
ru: Название теста не может быть пустым

source: The description of the test cannot be empty
ru: Описание теста не может быть пустым

source: The name of the discipline cannot be empty
ru: Название предмета не может быть пустым

source: The year cannot be empty
ru: Год не может быть пустым

source: Save
ru: Сохранить

source: The test has been successfully edited.
ru: Тест был успешно отредактирован.

source: Add
ru: Добавить

source: The test has been successfully added.
ru: Тест был успешно добавлен.

source: Correct
ru: Правильный

source: <span style="color: red">You MUST have exactly one correct answer</span>
ru: <span style="color: red">У Вас обязательно должен быть хотя бы один правильный ответ</span>

source: <a href="!base_path/admin/settings/simpletest/answers/edit/!aid">Edit</a>
ru: <a href="!base_path/admin/settings/simpletest/answers/edit/!aid">Редактировать</a>

source: <a href="!base_path/admin/settings/simpletest/answers/remove/!aid">Remove</a>
ru: <a href="!base_path/admin/settings/simpletest/answers/remove/!aid">Удалить</a>

source: There is no answers for this question yet
ru: Пока нет ответов на данный вопрос

source: <a href="!base_path/admin/settings/simpletest/answers/add/!qid">Add answer</a>
ru: <a href="!base_path/admin/settings/simpletest/answers/add/!qid">Добавить ответ</a>

source: The test has been successfully removed.
ru: Тест был успешно удален.

source: The question cannot be empty
ru: Вопрос не может быть пустым

source: The question has been successfully edited
ru: Вопрос был успешно отредактирован

source: Test id is wrong, or test has been removed
ru: ID теста неправильный, или тест был удален

source: The question has been successfylly added
ru: Вопрос был успешно добавлен

source: The question has been successfully removed.
ru: Вопрос был успешно удален

source: Incorrect answer id
ru: Неправильно ID ответа

source: The answer cannot be empty
ru: Ответ не может быть пустым

source: First Name
ru: Имя

source: Question !i
ru: Вопрос !i

source: Completed?
ru: Завершен?

source: Score
ru: Итог

source: Completed
ru: Завершено

source: In progress
ru: В процессе

source: Replacements
ru: Замены

source: If you want to replace text "<strong>[tex]</strong>" with "<strong>&lt;img src=/cgi-bin/tex.cgi?</strong>" and "<strong>[/tex]</strong>" with "<strong> /&gt;</strong>"<br /> just write it in JSON format like <code><br /> {<br /> &nbsp;&nbsp;"[tex]":"&lt;img src=/cgi-bin/tex.cgi?",<br /> &nbsp;&nbsp;"[/tex]":" /&lt;"<br /> }</code><br />
ru: Если Вы хотите заменить текст "<strong>[tex]</strong>" на "<strong>&lt;img src=/cgi-bin/tex.cgi?</strong>" и "<strong>[/tex]</strong>" на "<strong> /&gt;</strong>"<br /> просто напишите это в формате JSON в виде <code><br /> {<br /> &nbsp;&nbsp;"[tex]":"&lt;img src=/cgi-bin/tex.cgi?",<br /> &nbsp;&nbsp;"[/tex]":" /&lt;"<br /> }</code><br />

source: Do you really want to remove the question?
ru: Вы действительно хотите удалить вопрос?

source: SimpleTest remove the question
ru: Удалить вопрос SimpleTest

source: Edit the answer
ru: Редактировать ответ

source: SimpleTest edit the answer for the question
ru: Редактировать ответ на вопрос

source: Add new answer
ru: Добавить новый ответ

source: Simpletest add new answer to the question
ru: Добавить новый ответ на вопрос

source: Do you really want to remove this answer?
ru: Вы действительно хотите удалить этот ответ?

source: SimpleTest remove answer
ru: Удалить ответ

source: View Configured Settings
ru: Посмотреть настройки
